{"meta":{"title":"emmanuelnk","subtitle":"a coding blog","description":null,"author":"Emmanuel","url":"https://emmanuelnk.github.io","root":"/"},"pages":[],"posts":[{"title":"My Ultimate Hexo Theme Creation Tutorial","slug":"my-ultimate-create-hexo-theme-tutorial","date":"2017-11-07T17:13:31.000Z","updated":"2020-10-13T16:20:46.973Z","comments":true,"path":"2017/11/08/my-ultimate-create-hexo-theme-tutorial/","link":"","permalink":"https://emmanuelnk.github.io/2017/11/08/my-ultimate-create-hexo-theme-tutorial/","excerpt":"","text":"This post is mostly going to be written for myself and my friends so that if in the future I should forget how to Hexo or find the need to refer someone to use the Hexo platform, they can get into it without the difficulties I encountered. I will mostly cover theme creation with Hexo and what I’ve learned. I will try to make it as comprehensive as possible since most Hexo documentation and tutorials seems to be a bit too light.If you’re just interested in getting to blogging as quickly as possible and don’t mind using one of the available themes, I’d recommend taking a look at the Hexo quickstart guide by Christopher Martin (See Resources section at the bottom of this post) and the awesome Hexo theme Tranquilpeak by @LouisBarranqueiro.This post will also be continuously updated as I learn more.Why Hexo:Generates static blogs. PerfectIt’s built on NodeJSIt’s fastIt works with deployment to Github Pages, Heroku etcIt has a huge community of users, plugins and resourcesOf course you’re also free to check out Jekyll and Hugo static site and blog generators that use Ruby and Go respectively but I safely assume you’re here for the Javascript and we all know everything should be written in good old Javascript.Resources I tapped into:Feel free to refer to any of these in case you don’t understand something in my post. The aim of my tutorial is to organize all the information I got from these resources and my own experience with Hexo into one comprehensive tutorial.Hexo Official docs:link: docsThe Hexo documentation is pretty lean. Everything you need is listed but it lacks clarity on how eveything works together. This is especially noticable if you’re trying to create your own theme.Christopher Martin’s quick start guide on Hexo blogging:If you’re only interested in getting up and running with Hexo and want to make use of one of the available themes, this is the tutorial to head to:link: Getting Started With Hexo BlogJonathan Klughertz blog on Hexo theme creation:If, like me, you want to create your own Hexo theme, this one is good reading.link: Create an Hexo Theme Part-1Conner Leech blog post on Hexo theme creation:Another great read on Hexo theme creation.link: Create a custom blog theme with hexo jsSteven Seator blog post on Hexo theme creation:link: Creating a custom hexo themeYoutube playlist on Hexo by Giraffe Academy:A great youtube playlist that covers many beginner to intermediate Hexo topics.link: playlistCurated list of useful Hexo resources by @NoahDragon, a Hexo founder:link: awesome hexoDeploying Hexo to Github Pages:link: deploying hexo to gituhbGetting started:A great place to start would be the official installation instructions from the official Hexo site, hexo.io. From your command line, get into a directory on your computer where you would like to place your project and run the following code:npm install hexo-cli -ghexo init blogcd blognpm installhexo serverIf you now visit localhost:4000 in your browser, you should see you brand new blog. It uses the default but not very good-looking theme that Hexo ships with, Landscape.If you’re a person who doesn’t mind its low aesthetic appeal you can continue using it but I’d highly recommend you switch or create your own.From your favorite Text Editor/IDE (Atom, Sublime, VSCode and my personal recommendation: JetBrains Webstorm), open up the ‘blog’ directory you just installed Hexo in.The folder will have the following structure:├─node_modules ├─scaffolds ├─source │ └─_posts └─themes └─landscape _config.ymlpackage.jsonyarn.lock.gitignoreIf you’ve used NodeJS and NPM before, you’ll know what package.json and the node_modules folder are.To those new to this, package.json is a file that keeps track of all the modules your project depends on. These modules are then install in the node_modules folder when one runs npm install._config.yml is a file that contains all your configurations for Hexo. More on this later.scaffolds is a folder that keeps templates for your Hexo post types. source is where all your posts (md files) and images are kept.themes is where whichever theme you’re using is kept. We will spend most of our time in this folder when creating our custom theme.The configuration file (_config.yml):Open up the _config.yml file. I’ll break it down just a few sections.# Sitetitle: Hexosubtitle: A Totally Unique Hexo Blog description: This blog is really very uniqueauthor: John Doelanguage: entimezone:One thing to take care of when editing a yaml file like this is to make sure you have a space after the attribute. For example title: Hexo is title: space Hexo. Otherwise you’ll get build errors when generating your site.# URLurl: http://yoursite.comroot: /permalink: :year/:month/:day/:title/permalink_defaults:If you’re working on localhost, make sure you change the url variable to url: http://localhost:4000/. When you deploy to server make sure you change it back to the url of your domain.# Writingnew_post_name: :title.md # File name of new postsdefault_layout: posttitlecase: false # Transform title into titlecaseexternal_link: true # Open external links in new tabfilename_case: 0render_drafts: falsepost_asset_folder: falserelative_link: falsefuture: truehighlight: enable: true line_number: true auto_detect: false tab_replace:# Extensionstheme: landscapeIf your blog is one where you’ll upload many images per post, it would be helpful to turn the post_asset_folder to true. This will create a folder for each of your posts where you can store images and other assets related to that post. This will make your assets per post more manageable.You can use the theme variable to set the theme you would like to use.Get a breakdown of the rest of the configuration file variables and what they do here: Hexo ConfigurationWriting your first post:From your command line, and from inside the blog directory, type the following and hit enter:hexo new post my-amazing-new-postA new markdown file called my-amazing-new-post.mdwill be created in your source &gt; _posts directory.If you enabled the posts_assets_folder then you also get a folder with the title of your post in the same directory.Front Matter:From the docs:Front-matter is a block of YAML or JSON at the beginning of the filethat is used to configure settings for your writings. Front-matter isterminated by three dashes when written in YAML or three semicolonswhen written in JSON.It looks like this:---title: My amazing new postlayout: postdate: 2017-11-05 10:48:33author:categories: [hexo]tags: [hexo, blog creation, amazing]---Every post needs front matter. It represents the meta data of your post. You have to be careful when writing it though. You should have a space between the front matter and its value.More info here: Docs on Hexo Front MatterPost Content:The rest of the post can then be written in markdown.There are many resources online that can help you write markdown with ease. My personal favorite is SlackEdit because of the features and save to cloud functionality. When I’m ready to put it on my blog it’s a simple matter of copying and pasting the markdown into my post.Hexo also provides ways to insert specific types of content into your posts by way of Tag Plugins. Take a look! Theming:Now to what this whole blog post is about. Creating your own Hexo theme![to be continued soon]","categories":[{"name":"hexo","slug":"hexo","permalink":"https://emmanuelnk.github.io/categories/hexo/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://emmanuelnk.github.io/tags/hexo/"},{"name":"blog creation","slug":"blog-creation","permalink":"https://emmanuelnk.github.io/tags/blog-creation/"},{"name":"custom themes","slug":"custom-themes","permalink":"https://emmanuelnk.github.io/tags/custom-themes/"}],"author":"emmanuel"},{"title":"Hello Hexo","slug":"Hello-Hexo","date":"2017-11-05T02:48:33.000Z","updated":"2020-03-30T02:25:06.000Z","comments":false,"path":"2017/11/05/Hello-Hexo/","link":"","permalink":"https://emmanuelnk.github.io/2017/11/05/Hello-Hexo/","excerpt":"","text":"For a while now I’ve been growing weary of self-hosted Wordpress (for blogging purposes). The platform is old, bloated and feels like that car that you own that keeps breaking down but you can’t just let go.There’s nothing worse than logging into Wordpress, finding one million things that need to be updated and losing all your energy to blog. Or even worse, opening up your site to see “Hacked By Mister Spy” because of some server/plugin vulnerability that left your site to the wolves. Ughh.Wordpress (self-hosted) isn’t a terrible platform. It just has too many dependencies and machinery for someone interested in making a simple blog. You will be at the mercy of plugin developers and their ability to keep their code up to date. And if you’re like me (more of a Javascripter than PHPer), with Wordpress, you will also lose control of many design aspects of your site and will have to rely on the free and premium themes out there unless you’re willing to dive deep into Wordpress/PHP design code.So you can imagine my elation when one fateful day I came across an amazing article on the benefits of static sites for blogging. I had heard about static sites obviously but didn’t realize the existence of whole blogging platforms that utilize this principle. I quickly learned that static blogging sites are much easier to secure, they are blazingly fast, cheap to host (think github pages, heroku) and come with version control. This was perfect for me.Now if you’ve been reading into static blogging, you may think that it’s hard if you’re not a coder. That isn’t true. Top static blogging platforms like Jekyll, Hugo and Hexo comes with loads of pre-made themes that make it very easy for the non-coder to start right away. And creating posts with ugly markdown? Well there’s services that simplify that if you don’t want to get into the down and ugly. See: Prose or SiteleafAnother thing I love about Static blogging is the control I get over the design. I designed my own theme template for my blog. Coming in from a CSS3/HTML5/BOOTSTRAP/JS/NODE foundation, this was very easy for me to do. I didn’t have to go take apart a wordpress theme to fit it up to my standards. I wanted something minimal, beautiful but interesting. Something with wide spaces for easy reading and little quirky animations here and there. It would have taken me ages to find a wordpress theme like this but it only took me an hour in Bootstrap Studio to get the skeleton of my site down.Now that I had convinced myself to make the switch to a static blog, the final part was choosing a platform. This honestly wasn’t very hard for me though. The three largest static blogging platforms are Jekyll, Hugo and Hexo. Jekyll was my first choice because it had the largest community and documentation but I soon realized I wasn’t ready to commit to learning Ruby just for this effort. Hexo was the obvoius answer since it generates through NodeJS. Perfect.Hexo docs are pretty lean and it took me a few days to get into the flow of things and designing my own Hexo theme. I am happy with the result and still constantly working on imroving it as I learn more about Hexo. I will eventually clean up the code and release this theme as free to download to the Hexo community when it’s all done!My next post will be about my Hexo blog and theme creation process. Stay tuned!","categories":[{"name":"hexo","slug":"hexo","permalink":"https://emmanuelnk.github.io/categories/hexo/"}],"tags":[{"name":"hexo","slug":"hexo","permalink":"https://emmanuelnk.github.io/tags/hexo/"},{"name":"wordpress","slug":"wordpress","permalink":"https://emmanuelnk.github.io/tags/wordpress/"},{"name":"blog creation","slug":"blog-creation","permalink":"https://emmanuelnk.github.io/tags/blog-creation/"}],"author":null}]}